# ViewSolarstudyLightingPresetIndex Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSolarstudyLightingPresetIndex Property
ParameterTypeId Class See Also
---
"Lighting presets combo"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSolarstudyLightingPresetIndex { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSolarstudyLightingPresetIndex As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSolarstudyLightingPresetIndex {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace